Revit 2026 API

# EnergyAnalysisUtilitiesDBFailures Properties

---

The BuiltInFailuresEnergyAnalysisUtilitiesDBFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AimErrEmptyName | MassZone '%1' has empty name and id values which cannot be used as gbXML identifiers. |

#### Reference

BuiltInFailuresEnergyAnalysisUtilitiesDBFailures Class

Autodesk.Revit.DB Namespace